# Barni Operating System Personal License (BOS-PL)
Версия 1.0, [Дата]

## Определения
"Программное обеспечение" (ПО) означает код, документацию и любые связанные материалы проекта "Barni-Operating-System", доступного по адресу: https://github.com/ArtemShamaev/Barni-Operating-System.

"Личное использование" означает использование исключительно для некоммерческих, образовательных, хобби-целей и не предполагает получения прямой или косвенной финансовой выгоды.

"Лицензиат" означает любое физическое или юридическое лицо, использующее ПО на условиях данной лицензии.

## Область действия лицензии
Настоящим Вам предоставляется всемирная, безвозмездная, непередаваемая, неисключительная лицензия на использование ПО для Личного использования.

## Запреты
Вы не имеете права:
1.  Модифицировать, адаптировать, переводить или создавать производные работы на основе ПО.
2.  Распространять, копировать или передавать ПО третьим лицам, за исключением случаев, прямо предусмотренных настоящей лицензией.
3.  Использовать ПО в коммерческих целях, включая, но не ограничиваясь: продажа, аренда, сдача внаём, включение в состав коммерческого продукта или услуги, получение дохода от рекламы.
4.  Сублицензировать ПО.
5.  Удалять или изменять любые уведомления об авторских правах или товарных знаках в ПО.

## Коммерческое лицензирование
Любое использование ПО, выходящее за рамки Личного использования, требует заключения отдельного коммерческого лицензионного договора. Для получения коммерческой лицензии, пожалуйста, свяжитесь с автором: [Ваша контактная информация].

## Отказ от гарантий
ПО ПРЕДОСТАВЛЯЕТСЯ "КАК ЕСТЬ", БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ. АВТОР НЕ НЕСЕТ ОТВЕТСТВЕННОСТИ ЗА ЛЮБЫЕ УБЫТКИ, СВЯЗАННЫЕ С ИСПОЛЬЗОВАНИЕМ ДАННОГО ПО.

## Авторские права
Авторские права на ПО принадлежат [Шамаев Артем Русланович] (Artem Shamaev). Все права, явно не предоставленные настоящей лицензией, сохранены.
    / \__
   (    @\____
  /        O /
 /   (_____/
 /_____/   U
 Copyright (C) BARNINO SYSTEMS (2026), all rights reserved.
